Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized/ESP32_HVAC_CoolBreezeNexus_V2_Optimized.ino
/*
 * ============================================
 * ESP32 R32 - Cool Breeze Nexus Integration
 * Production HVAC Monitoring System - PRODUCTION
 * ============================================
 * 
 * VERSION: 2.2.0-PROD (Production - No Debug Output)
 * COMPATIBILITY: ESP32 Arduino Core 2.0.11 - 3.0.x
 * 
 * OPTIMIZATIONS:
 * - Data transmission: Every 2 minutes (120 seconds)
 * - Reduced bandwidth usage by 50%
 * - No serial debugging - lightweight and fast
 * - Lower power consumption
 * 
 * FEATURES:
 * - WiFiManager for easy WiFi configuration
 * - Supabase HTTP POST integration (Dashboard Compatible)
 * - WiFi/ADC conflict resolution (WiFi OFF during sensor reading)
 * - 2-minute averaged sensor readings
 * - Timeout mechanisms for slow/failed connections
 * - Automatic 6-month full reset (memory leak prevention)
 * - Auto reset every 6 hours (improved reliability)
 * - Watchdog timer (60s) to prevent stalls
 * - Boot button hold (5s) to enter config mode
 * - WiFi stuck detection and auto-recovery
 * - RTC memory for persistent uptime tracking
 * 
 * ============================================
 */

#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <Preferences.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <esp_task_wdt.h>
#include <EmonLib.h>
#include <esp_adc_cal.h>
#include <time.h>
#include <esp_system.h>
#include <ArduinoJson.h>

// ============================================
// DEVICE CONFIGURATION
// ============================================
const String DEVICE_ID = "R32";
const String FIRMWARE_VERSION = "2.2.0-PROD";

// ============================================
// TIMING CONSTANTS
// ============================================
const unsigned long SENSOR_READ_INTERVAL = 1000;
const unsigned long DATA_SEND_INTERVAL = 120000;
const unsigned long WIFI_CONNECT_TIMEOUT = 30000;
const unsigned long HTTP_POST_TIMEOUT = 10000;
const unsigned long MAX_WIFI_ON_TIME = 60000;
const unsigned long AUTO_RESET_INTERVAL = 21600000;
const unsigned long SIX_MONTH_RESET = 15552000000ULL;
const unsigned long BOOT_BUTTON_HOLD_TIME = 5000;
const unsigned long WATCHDOG_TIMEOUT = 60;
const unsigned long WIFI_STUCK_TIMEOUT = 120000;

// ============================================
// Pin Definitions
// ============================================
const int TEMP_PIN_MOTOR = 21;
const int TEMP_PIN_EXTERIOR = 22;
const int TEMP_PIN_INTERIOR = 23;
const int CT_PIN = 36;
const int FLOAT_PIN = 5;
const int GPIO_YELLOW_EXHAUST = 34;
const int GPIO_GREEN_FAN = 35;
const int GPIO_BROWN_PUMP = 32;
const int GPIO_BLACK_DRAIN = 33;
const int BOOT_BUTTON_PIN = 0;

// ============================================
// Temperature Sensor Setup
// ============================================
OneWire oneWireMotor(TEMP_PIN_MOTOR);
OneWire oneWireExterior(TEMP_PIN_EXTERIOR);
OneWire oneWireInterior(TEMP_PIN_INTERIOR);

DallasTemperature sensorMotor(&oneWireMotor);
DallasTemperature sensorExterior(&oneWireExterior);
DallasTemperature sensorInterior(&oneWireInterior);

// ============================================
// CT Sensor Configuration
// ============================================
EnergyMonitor emon1;
const float CALIBRATION = 16.5;
const float MIN_CURRENT_THRESHOLD = 1.0;
const float MAX_CURRENT_THRESHOLD = 16.0;
const float LINE_VOLTAGE = 230.0;
const float ADC_VREF = 3.3;

// ============================================
// Pickup ADC Configuration
// ============================================
const int ADC_SAMPLES = 100;
const int ADC_SAMPLE_DELAY_US = 150;
esp_adc_cal_characteristics_t adc_chars;

const float VOLTAGE_DISCONNECTED_MAX = 0.5;
const float VOLTAGE_ON_MIN = 0.8;
const float VOLTAGE_ON_MAX = 2.632;
const float VOLTAGE_OFF_MIN = 2.807;

const float FAN_VOLTAGE_100_SPEED = 1.053;
const float FAN_VOLTAGE_0_SPEED = 2.035;

const int FILTER_SIZE = 3;
float yellowFilter[FILTER_SIZE] = {0};
float greenFilter[FILTER_SIZE] = {0};
float brownFilter[FILTER_SIZE] = {0};
float blackFilter[FILTER_SIZE] = {0};
int filterIndex = 0;

// ============================================
// WiFi & Supabase Configuration
// ============================================
WiFiManager wifiManager;
Preferences preferences;

const char* SUPABASE_URL = "https://wjyanxstvbiqefmgpccb.supabase.co";
const char* SUPABASE_ANON_KEY = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6IndqeWFueHN0dmJpcWVmbWdwY2NiIiwicm9sZSI6ImFub24iLCJpYXQiOjE3NjIyMzI4NDUsImV4cCI6MjA3NzgwODg0NX0.r1xQG8HYHioH8_ALGQTRO2wM5F2tAOhM-xe_eh3VxhY";

String supabaseUrl = "";
String supabaseAnonKey = "";
String machineUUID = "";
String machineAPIKey = "";

bool wifiEnabled = false;
unsigned long wifiOnStartTime = 0;

// ============================================
// Data Accumulation for Averaging
// ============================================
struct SensorAccumulator {
  float tempMotorSum;
  float tempExteriorSum;
  float tempInteriorSum;
  float ctCurrentSum;
  float ctVoltageSum;
  float apparentPowerSum;
  float yellowVoltageSum;
  float greenVoltageSum;
  float brownVoltageSum;
  float blackVoltageSum;
  int tankFullCount;
  int sampleCount;
  
  String yellowStatus;
  String greenStatus;
  String brownStatus;
  String blackStatus;
  int fanSpeed;
  
  void reset() {
    tempMotorSum = 0;
    tempExteriorSum = 0;
    tempInteriorSum = 0;
    ctCurrentSum = 0;
    ctVoltageSum = 0;
    apparentPowerSum = 0;
    yellowVoltageSum = 0;
    greenVoltageSum = 0;
    brownVoltageSum = 0;
    blackVoltageSum = 0;
    tankFullCount = 0;
    sampleCount = 0;
  }
  
  void addSample(float tMotor, float tExterior, float tInterior,
                 float ctCurr, float ctVolt, float appPower,
                 float yVolt, float gVolt, float bVolt, float blVolt,
                 bool tankFull, String yStatus, String gStatus, 
                 String bStatus, String blStatus, int fSpeed) {
    tempMotorSum += tMotor;
    tempExteriorSum += tExterior;
    tempInteriorSum += tInterior;
    ctCurrentSum += ctCurr;
    ctVoltageSum += ctVolt;
    apparentPowerSum += appPower;
    yellowVoltageSum += yVolt;
    greenVoltageSum += gVolt;
    brownVoltageSum += bVolt;
    blackVoltageSum += blVolt;
    if(tankFull) tankFullCount++;
    sampleCount++;
    
    yellowStatus = yStatus;
    greenStatus = gStatus;
    brownStatus = bStatus;
    blackStatus = blStatus;
    fanSpeed = fSpeed;
  }
} accumulator;

