Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized/ESP32_HVAC_CoolBreezeNexus_V2_Optimized.ino
// ============================================
// RTC Memory for Uptime Tracking
// ============================================
RTC_DATA_ATTR unsigned long totalUptimeSeconds = 0;
RTC_DATA_ATTR unsigned long lastResetTime = 0;
RTC_DATA_ATTR bool rtcInitialized = false;

// ============================================
// Timing Variables
// ============================================
unsigned long lastSensorRead = 0;
unsigned long lastDataSend = 0;
unsigned long lastAutoReset = 0;
unsigned long bootTime = 0;
unsigned long bootButtonPressTime = 0;
bool bootButtonPressed = false;
unsigned long lastWatchdogFeed = 0;
unsigned long wifiStuckStartTime = 0;
bool wifiStuckDetected = false;

// ============================================
// Function Prototypes
// ============================================
void launchConfigPortal();
void saveConfigCallback();
void checkBootButton(unsigned long currentMillis);
void checkWiFiStuck(unsigned long currentMillis);
void performAutoReset();
void loadConfiguration();
void saveConfiguration();
void initializeWiFiManager();

// ============================================
// State Machine
// ============================================
enum SystemState {
  STATE_SENSOR_READING,
  STATE_WIFI_CONNECT,
  STATE_DATA_SEND,
  STATE_WIFI_DISCONNECT
};
SystemState currentState = STATE_SENSOR_READING;

// ============================================
// SETUP
// ============================================
void setup() {
  delay(2000);
  
  if(!rtcInitialized) {
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    rtcInitialized = true;
  }
  
  bootTime = millis();
  lastAutoReset = bootTime;
  lastWatchdogFeed = bootTime;
  
  pinMode(BOOT_BUTTON_PIN, INPUT_PULLUP);
  
  unsigned long uptimeMillis = totalUptimeSeconds * 1000ULL;
  if(uptimeMillis >= SIX_MONTH_RESET) {
    preferences.begin("iot-nexus", false);
    preferences.clear();
    preferences.end();
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    ESP.restart();
  }
  
  preferences.begin("iot-nexus", false);
  
  loadConfiguration();
  initializeWiFiManager();
  
  initializeHardware();
  
  esp_task_wdt_deinit();
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    esp_task_wdt_config_t twdt_config = {
      .timeout_ms = (uint32_t)WATCHDOG_TIMEOUT * 1000,
      .idle_core_mask = 0,
      .trigger_panic = true
    };
    esp_task_wdt_init(&twdt_config);
    esp_task_wdt_add(NULL);
  #else
    esp_task_wdt_init(WATCHDOG_TIMEOUT, true);
    esp_task_wdt_add(NULL);
  #endif
  
  WiFi.mode(WIFI_OFF);
  wifiEnabled = false;
  
  currentState = STATE_SENSOR_READING;
  accumulator.reset();
}

// ============================================
// Initialize Hardware
// ============================================
void initializeHardware() {
  analogSetAttenuation(ADC_11db);
  analogSetWidth(12);
  esp_adc_cal_characterize(ADC_UNIT_1, (adc_atten_t)ADC_ATTEN_DB_11, (adc_bits_width_t)ADC_WIDTH_BIT_12, 1100, &adc_chars);
  
  pinMode(CT_PIN, INPUT);
  emon1.current(CT_PIN, CALIBRATION);
  
  sensorMotor.begin();
  sensorExterior.begin();
  sensorInterior.begin();
  
  pinMode(FLOAT_PIN, INPUT_PULLUP);
  
  pinMode(GPIO_YELLOW_EXHAUST, INPUT);
  pinMode(GPIO_GREEN_FAN, INPUT);
  pinMode(GPIO_BROWN_PUMP, INPUT);
  pinMode(GPIO_BLACK_DRAIN, INPUT);
}

// ============================================
// MAIN LOOP - State Machine
// ============================================
void loop() {
  unsigned long currentMillis = millis();
  
  if(currentMillis - lastWatchdogFeed >= 1000) {
    esp_task_wdt_reset();
    lastWatchdogFeed = currentMillis;
  }
  
  checkBootButton(currentMillis);
  
  if(currentMillis - lastAutoReset >= AUTO_RESET_INTERVAL) {
    performAutoReset();
  }
  
  static unsigned long lastUptimeUpdate = 0;
  if(currentMillis - lastUptimeUpdate >= 1000) {
    totalUptimeSeconds++;
    lastUptimeUpdate = currentMillis;
  }
  
  checkWiFiStuck(currentMillis);
  checkWiFiTimeout();
  
  switch(currentState) {
    case STATE_SENSOR_READING:
      stateSensorReading(currentMillis);
      break;
    case STATE_WIFI_CONNECT:
      stateWiFiConnect(currentMillis);
      break;
    case STATE_DATA_SEND:
      stateDataSend(currentMillis);
      break;
    case STATE_WIFI_DISCONNECT:
      stateWiFiDisconnect(currentMillis);
      break;
  }
  
  delay(10);
}

// ============================================
// STATE: Sensor Reading (WiFi OFF)
// ============================================
void stateSensorReading(unsigned long currentMillis) {
  if(currentMillis - lastSensorRead >= SENSOR_READ_INTERVAL) {
    if(wifiEnabled) {
      disableWiFi();
    }
    
    float tMotor = readTemperature(sensorMotor);
    float tExterior = readTemperature(sensorExterior);
    float tInterior = readTemperature(sensorInterior);
    
    float ctCurrent, ctVoltage, apparentPower;
    readCTSensor(ctCurrent, ctVoltage, apparentPower);
    
    bool tankFull = (digitalRead(FLOAT_PIN) == LOW);
    
    float yVolt, gVolt, bVolt, blVolt;
    String yStatus, gStatus, bStatus, blStatus;
    int fanSpeed;
    readPickups(yVolt, gVolt, bVolt, blVolt, yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
    accumulator.addSample(tMotor, tExterior, tInterior, ctCurrent, ctVoltage, 
                          apparentPower, yVolt, gVolt, bVolt, blVolt, tankFull,
                          yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
    lastSensorRead = currentMillis;
  }
  
  if(currentMillis - lastDataSend >= DATA_SEND_INTERVAL) {
    if(accumulator.sampleCount > 0) {
      currentState = STATE_WIFI_CONNECT;
    } else {
      lastDataSend = currentMillis;
    }
  }
}

// ============================================
// STATE: WiFi Connect
// ============================================
void stateWiFiConnect(unsigned long currentMillis) {
  enableWiFi();
  
  unsigned long connectStart = millis();
  bool connected = false;
  
  WiFi.mode(WIFI_STA);
  WiFi.begin();
  
  int connectAttempts = 0;
  while(millis() - connectStart < WIFI_CONNECT_TIMEOUT) {
    if(WiFi.status() == WL_CONNECTED) {
      connected = true;
      break;
    }
    delay(500);
    connectAttempts++;
    
    if(connectAttempts % 4 == 0) {
      esp_task_wdt_reset();
    }
    
    if(millis() - connectStart > WIFI_CONNECT_TIMEOUT) {
      break;
    }
  }
  
  if(connected) {
    configTime(0, 0, "pool.ntp.org");
    wifiStuckDetected = false;
    currentState = STATE_DATA_SEND;
  } else {
    accumulator.reset();
    lastDataSend = millis();
    currentState = STATE_WIFI_DISCONNECT;
  }
}

