Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized/ESP32_HVAC_CoolBreezeNexus_V2_Optimized.ino
// ============================================
// STATE: Data Send
// ============================================
void stateDataSend(unsigned long currentMillis) {
  if(supabaseUrl.length() == 0 || machineUUID.length() == 0 || machineAPIKey.length() == 0) {
    accumulator.reset();
    lastDataSend = millis();
    currentState = STATE_WIFI_DISCONNECT;
    return;
  }
  
  float avgTempMotor = accumulator.tempMotorSum / accumulator.sampleCount;
  float avgTempExterior = accumulator.tempExteriorSum / accumulator.sampleCount;
  float avgTempInterior = accumulator.tempInteriorSum / accumulator.sampleCount;
  float avgCtCurrent = accumulator.ctCurrentSum / accumulator.sampleCount;
  float avgCtVoltage = accumulator.ctVoltageSum / accumulator.sampleCount;
  float avgApparentPower = accumulator.apparentPowerSum / accumulator.sampleCount;
  float avgYellowVoltage = accumulator.yellowVoltageSum / accumulator.sampleCount;
  float avgGreenVoltage = accumulator.greenVoltageSum / accumulator.sampleCount;
  float avgBrownVoltage = accumulator.brownVoltageSum / accumulator.sampleCount;
  float avgBlackVoltage = accumulator.blackVoltageSum / accumulator.sampleCount;
  bool tankFullAvg = (accumulator.tankFullCount > (accumulator.sampleCount / 2));
  
  sendToSupabase(
    avgTempMotor, avgTempExterior, avgTempInterior,
    avgCtCurrent, avgCtVoltage, avgApparentPower,
    avgYellowVoltage, avgGreenVoltage, avgBrownVoltage, avgBlackVoltage,
    tankFullAvg,
    accumulator.yellowStatus, accumulator.greenStatus,
    accumulator.brownStatus, accumulator.blackStatus,
    accumulator.fanSpeed
  );
  
  accumulator.reset();
  lastDataSend = millis();
  currentState = STATE_WIFI_DISCONNECT;
}

// ============================================
// STATE: WiFi Disconnect
// ============================================
void stateWiFiDisconnect(unsigned long currentMillis) {
  disableWiFi();
  currentState = STATE_SENSOR_READING;
}

// ============================================
// Enable WiFi
// ============================================
void enableWiFi() {
  if(!wifiEnabled) {
    WiFi.mode(WIFI_STA);
    wifiEnabled = true;
    wifiOnStartTime = millis();
  }
}

// ============================================
// Disable WiFi (CRITICAL for ADC stability)
// ============================================
void disableWiFi() {
  if(wifiEnabled) {
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
    wifiEnabled = false;
    delay(100);
  }
}

// ============================================
// Safety Net: Force WiFi Off After Timeout
// ============================================
void checkWiFiTimeout() {
  if(wifiEnabled && (millis() - wifiOnStartTime > MAX_WIFI_ON_TIME)) {
    disableWiFi();
    currentState = STATE_SENSOR_READING;
  }
}

// ============================================
// Read Temperature Sensor
// ============================================
float readTemperature(DallasTemperature &sensor) {
  sensor.requestTemperatures();
  float temp = sensor.getTempCByIndex(0);
  
  if(temp == DEVICE_DISCONNECTED_C || temp < -50 || temp > 125) {
    return -999.0;
  }
  
  return temp;
}

// ============================================
// Read CT Sensor
// ============================================
void readCTSensor(float &current, float &voltage, float &power) {
  int adcValue = analogRead(CT_PIN);
  voltage = (adcValue / 4095.0) * ADC_VREF;
  
  double irms = emon1.calcIrms(1480);
  current = irms;
  
  if(current < 0.1) {
    current = 0.0;
  } else if(current < MIN_CURRENT_THRESHOLD) {
    current = 0.0;
  } else {
    current = constrain(current, 0, MAX_CURRENT_THRESHOLD);
  }
  
  power = current * LINE_VOLTAGE;
}

// ============================================
// Read Pickup Inputs
// ============================================
void readPickups(float &yVolt, float &gVolt, float &bVolt, float &blVolt,
                 String &yStatus, String &gStatus, String &bStatus, String &blStatus,
                 int &fanSpeed) {
  yVolt = readStableVoltage(GPIO_YELLOW_EXHAUST, yellowFilter);
  gVolt = readStableVoltage(GPIO_GREEN_FAN, greenFilter);
  bVolt = readStableVoltage(GPIO_BROWN_PUMP, brownFilter);
  blVolt = readStableVoltage(GPIO_BLACK_DRAIN, blackFilter);
  
  filterIndex = (filterIndex + 1) % FILTER_SIZE;
  
  yStatus = getStatus(yVolt);
  gStatus = getStatus(gVolt);
  bStatus = getStatus(bVolt);
  blStatus = getStatus(blVolt);
  
  fanSpeed = calculateFanSpeed(gVolt, gStatus);
}

// ============================================
// Read Stable Voltage with Averaging
// ============================================
float readStableVoltage(int pin, float* filterArray) {
  for(int i = 0; i < 10; i++) {
    analogRead(pin);
    delayMicroseconds(ADC_SAMPLE_DELAY_US);
  }
  
  long sum = 0;
  for(int i = 0; i < ADC_SAMPLES; i++) {
    sum += analogRead(pin);
    delayMicroseconds(ADC_SAMPLE_DELAY_US);
  }
  
  float avgADC = sum / (float)ADC_SAMPLES;
  float voltage = (avgADC / 4095.0) * ADC_VREF;
  
  filterArray[filterIndex] = voltage;
  
  float filteredSum = 0;
  for(int i = 0; i < FILTER_SIZE; i++) {
    filteredSum += filterArray[i];
  }
  
  return filteredSum / FILTER_SIZE;
}

// ============================================
// Get Pickup Status from Voltage
// ============================================
String getStatus(float voltage) {
  if(voltage < VOLTAGE_DISCONNECTED_MAX) {
    return "DISCONNECTED";
  } else if(voltage >= VOLTAGE_ON_MIN && voltage <= VOLTAGE_ON_MAX) {
    return "ON";
  } else if(voltage >= VOLTAGE_OFF_MIN) {
    return "OFF";
  } else {
    return "UNKNOWN";
  }
}

// ============================================
// Calculate Fan Speed
// ============================================
int calculateFanSpeed(float voltage, String status) {
  if(status != "ON") {
    return 0;
  }
  
  if(voltage >= FAN_VOLTAGE_100_SPEED && voltage <= FAN_VOLTAGE_0_SPEED) {
    float speedFloat = 100.0 - ((voltage - FAN_VOLTAGE_100_SPEED) / 
                      (FAN_VOLTAGE_0_SPEED - FAN_VOLTAGE_100_SPEED)) * 100.0;
    return constrain((int)speedFloat, 0, 100);
  } else if(voltage < FAN_VOLTAGE_100_SPEED) {
    return 100;
  } else {
    return 0;
  }
}

