Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized/ESP32_HVAC_CoolBreezeNexus_V2_Optimized.ino
// ============================================
// Send Data to Supabase (DASHBOARD COMPATIBLE)
// ============================================
bool sendToSupabase(float tMotor, float tExterior, float tInterior,
                    float ctCurrent, float ctVoltage, float appPower,
                    float yVolt, float gVolt, float bVolt, float blVolt,
                    bool tankFull,
                    String yStatus, String gStatus, String bStatus, String blStatus,
                    int fanSpeed) {
  
  if(WiFi.status() != WL_CONNECTED) return false;
  
  HTTPClient http;
  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(HTTP_POST_TIMEOUT / 1000);
  http.setTimeout(HTTP_POST_TIMEOUT);
  http.setConnectTimeout(5000);
  
  String endpoint = supabaseUrl + "/functions/v1/esp32-data-receiver";
  
  StaticJsonDocument<768> doc;
  
  doc["machine_id"] = machineUUID;
  doc["motor_temp"] = tMotor;
  doc["outside_temp"] = tExterior;
  doc["inside_temp"] = tInterior;
  doc["current"] = ctCurrent;
  doc["voltage"] = LINE_VOLTAGE;
  doc["power"] = appPower;
  doc["has_water"] = tankFull;
  doc["exhaust_voltage"] = yVolt;
  doc["fan_voltage"] = gVolt;
  doc["pump_voltage"] = bVolt;
  doc["drain_voltage"] = blVolt;
  doc["sensor_read_count"] = accumulator.sampleCount;
  
  String jsonString;
  serializeJson(doc, jsonString);
  
  esp_task_wdt_reset();
  
  http.begin(client, endpoint);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("apikey", supabaseAnonKey);
  http.addHeader("Authorization", "Bearer " + machineAPIKey);
  
  int httpCode = http.POST(jsonString);
  
  esp_task_wdt_reset();
  
  bool success = (httpCode == 201 || httpCode == 200);
  
  http.end();
  
  return success;
}

// ============================================
// Initialize WiFiManager
// ============================================
void initializeWiFiManager() {
  wifiManager.setConfigPortalTimeout(180);
  wifiManager.setAPStaticIPConfig(IPAddress(192,168,4,1), IPAddress(192,168,4,1), IPAddress(255,255,255,0));
  wifiManager.setSaveConfigCallback(saveConfigCallback);
  
  supabaseUrl = String(SUPABASE_URL);
  supabaseAnonKey = String(SUPABASE_ANON_KEY);
  
  WiFiManagerParameter customMachineUUID("machine_uuid", "Machine UUID (from Dashboard)", machineUUID.c_str(), 40);
  WiFiManagerParameter customMachineAPIKey("api_key", "Machine API Key (from Dashboard)", machineAPIKey.c_str(), 100);
  
  wifiManager.addParameter(&customMachineUUID);
  wifiManager.addParameter(&customMachineAPIKey);
  
  String savedSSID = WiFi.SSID();
  if(savedSSID.length() == 0) {
    wifiManager.autoConnect("ESP32_HVAC_Setup");
  } else {
    WiFi.mode(WIFI_STA);
    WiFi.begin();
    unsigned long connectStart = millis();
    while(WiFi.status() != WL_CONNECTED && (millis() - connectStart < 10000)) {
      delay(500);
    }
  }
  
  machineUUID = String(customMachineUUID.getValue());
  machineAPIKey = String(customMachineAPIKey.getValue());
  
  saveConfiguration();
}

// ============================================
// Load Configuration
// ============================================
void loadConfiguration() {
  supabaseUrl = String(SUPABASE_URL);
  supabaseAnonKey = String(SUPABASE_ANON_KEY);
  machineUUID = preferences.getString("machine_uuid", machineUUID.c_str());
  machineAPIKey = preferences.getString("api_key", machineAPIKey.c_str());
}

// ============================================
// Save Configuration
// ============================================
void saveConfiguration() {
  preferences.putString("machine_uuid", machineUUID);
  preferences.putString("api_key", machineAPIKey);
}

// ============================================
// Launch WiFiManager Config Portal (for boot button)
// ============================================
void launchConfigPortal() {
  wifiManager.startConfigPortal("ESP32_HVAC_Setup");
}

// ============================================
// WiFiManager Save Config Callback
// ============================================
void saveConfigCallback() {
  // Config saved by WiFiManager
}

// ============================================
// Check Boot Button (5 second hold to enter config)
// ============================================
void checkBootButton(unsigned long currentMillis) {
  bool buttonState = digitalRead(BOOT_BUTTON_PIN) == LOW;
  
  if(buttonState && !bootButtonPressed) {
    bootButtonPressTime = currentMillis;
    bootButtonPressed = true;
  } else if(buttonState && bootButtonPressed) {
    unsigned long holdTime = currentMillis - bootButtonPressTime;
    if(holdTime >= BOOT_BUTTON_HOLD_TIME) {
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      
      preferences.begin("iot-nexus", false);
      preferences.clear();
      preferences.end();
      
      wifiManager.resetSettings();
      
      delay(2000);
      ESP.restart();
    }
  } else if(!buttonState && bootButtonPressed) {
    bootButtonPressed = false;
  }
}

// ============================================
// Check for WiFi Stuck Condition
// ============================================
void checkWiFiStuck(unsigned long currentMillis) {
  if(wifiEnabled && WiFi.status() != WL_CONNECTED) {
    if(!wifiStuckDetected) {
      wifiStuckStartTime = currentMillis;
      wifiStuckDetected = true;
    } else {
      if(currentMillis - wifiStuckStartTime > WIFI_STUCK_TIMEOUT) {
        delay(1000);
        ESP.restart();
      }
    }
  } else {
    wifiStuckDetected = false;
  }
}

// ============================================
// Perform Auto Reset (Soft Reset - 6 hours)
// ============================================
void performAutoReset() {
  delay(1000);
  ESP.restart();
}

